Revit 2026 API

# BaseImportOptions Methods

---

The BaseImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDefaultLengthUnit | Get the default length unit used for importing unitless files. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLayerSelection | Get all set layers name which user want to import into Revit. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetDefaultLengthUnit | Set the default length unit used for importing unitless files. |
|  | SetLayerSelection |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

BaseImportOptions Class

Autodesk.Revit.DB Namespace